import React from 'react';

const MyComponent = () => {
    return (
        <div className="container">
            <h3 style={{textAlign: 'center', fontSize: "18px", marginBottom: "20px"}}>Политика конфиденциальности</h3>
<div >
    ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ ДЛЯ ВЕБ-САЙТА
    1. ОПРЕДЕЛЕНИЕ ПОНЯТИЙ
    "Закон" означает закон Республика Казахстан "О персональных данных" со всеми изменениями и дополнениями, а также иные законодательные акты Республики Казахстан.
    "Сайт" означает информационную единицу в Интернете, ресурс из веб-страниц (документов), которые объединены общей темой и связаны между друг с другом с помощью ссылок. Он зарегистрирован на Правообладателя и обязательно привязан к конкретному домену, являющемуся его адресом. Настоящая Политика разработана для следующего сайта: ________
    "Персональные данные" означает совокупность личных данных и/или неперсонифицированной информации о Пользователе, предоставляемую им самим Правообладателю и/или автоматически собираемую Правообладателем и/или третьими лицами.
    "Политика" означает настоящею Политику конфиденциальности для веб-сайта (со всеми существующими дополнениями и изменениями).
    "Пользователь" означает юридическое или физическое лицо, которое пользуется Сайтом и/или получило к нему доступ с какого-либо устройства.
    "Пользовательское соглашение" означает соглашение, заключаемое между Правообладателем и Пользователем в отношении порядка, правил и особенностей использования Сайта. Пользователь присоединяется к такому соглашению и не имеет права вносить и/или требовать внесения в него каких-либо изменений или дополнений.
    "Правообладатель" означает следующее лицо, на имя которого зарегистрирован Сайт:
    ИП "Каржау"
    РК г.Шымкент, ул. Мынбаев 69
    +7 (707) 167-16-82
    remont.shymkent.kz@gmail.com
    "Файлы куки" означает небольшие файлы, отправляемые каким-либо сайтом, и размещаемые на компьютерах, смартфонах, планшетах, часах и других мобильных устройствах Пользователя, для улучшения работы сайтов, а также качества размещенного в них контента.


    2. ОТНОШЕНИЯ, НА КОТОРЫЕ РАСПРОСТРАНЯЕТСЯ ПОЛИТИКА
    Общие положения
    Данная Политика используется и применима исключительно к Персональным данным, получаемым от Пользователя в связи с использованием им Сайта. Положения данной Политики направлены на:
    (1) определение видов и типов получаемых Персональных данных, направлений и целей использования (обработки) Персональных данных, а также источников получения таких Персональных данных; и
    (2) определение прав Пользователя в отношении защиты конфиденциальности передаваемых им Персональных данных; и
    (3) определение лиц, ответственных за обработку и хранение Персональных данных, а также третьих лиц, которым такие данные раскрываются (полностью или частично).
    Правила настоящей Политики не применяются в случае обработки третьими лицами Персональных данных, которые добровольно предоставляются Пользователем.
    Посредством использования Сайта Пользователь соглашается с условиями данной Политики и дает свое согласие Правообладателю на сбор, обработку, удержание и хранение Персональных данных в порядке и на условиях, предусмотренных настоящей Политикой.
    Если Пользователь не согласен с условиями Политики и/или отдельные условия Политики ему не понятны, в таком случае Пользователь обязан немедленно прекратить использование Сайта.
    Права пользователя по защите персональных данных
    В связи с предоставлением Персональных данных Пользователь автоматически получает следующие права:
    (1) получать данные, касающиеся их обработки (основания и цели такой обработки, применяемые способы обработки, сведения о лицах, которые имеют доступ к ним или которым они могут быть раскрыты на основании договора или Закона).
    (2) получать данные о месте нахождения и идентификационных данных лиц, совершающих обработку Персональных данных.
    (3) получать данные о сроках хранения Персональных данных.
    (4) получать данные об осуществленной или о предполагаемой трансграничной передаче Персональных данных.
    (5) обжаловать действия или бездействие Правообладателя в уполномоченный орган по защите прав субъектов персональных данных или в судебном порядке.
    (6) получать возмещение убытков и/или компенсацию морального вреда в судебном порядке в следствие допущенных Правообладателем и/или третьими лицами нарушений прав Пользователя на охрану и защиту его Персональных данных.
    (7) реализовывать иные права в области защиты персональных данных, предусмотренные Законом или положениями данной Политики.


    3. ПЕРЕЧЕНЬ СОБИРАЕМЫХ ПЕРСОНАЛЬНЫХ ДАННЫХ
    Неперсонифицированная информация о пользователях
    В связи с использованием Сайта Правообладатель может автоматически собирать и обрабатывать следующею неперсонифицированную информацию о Пользователе:
    (1) информацию о трафике, возможном количестве совершенных кликов, логи и другие данные.
    (2) информацию об устройстве (идентификационный номер устройства, с которого выполняется вход, операционная система, платформа, тип браузера и другая информация о браузере, IP адрес).
    Личные данные о пользователях
    Правообладатель не собирает какие-либо личные данные о Пользователях, которые позволяют его идентифицировать.
    Использование файлов куки
    Сайт применяет определенные Файлы куки для сохранения IP-адреса, предпочтений Пользователей или типа используемого устройства с целью (1) ведения статистики посещений и трафика сайта, и (2) персонализации выводимых на экран Пользователя данных, и (3) сохранения данных, необходимых для идентификации Пользователя, в том числе при доступе с разных устройств, и (4) показа рекламы в соответствии с интересами и предпочтениями Пользователя. Сайт может использовать как собственные Файлы куки, принадлежащие Правообладателю, так и Файлы куки третьих лиц.
    Сайт использует следующие Файлы куки:
    (1) Технические (функциональные) Файлы куки, которые нужны для контроля трафика и передачи данных, для идентификации Пользователей и предоставления доступа Пользователю к контенту и без которых использование Сайта является функционально ограниченным, а также для предотвращения предоставления рекомендаций, не соответствующих интересам Пользователя.
    (2) Статистические Файлы куки, которые нужны для отслеживания частоты посещаемости сайта Пользователями, для выявления способов использования Сайта, а также для выявления типа и вида контента, который является популярными или интересным для Пользователя.
    (3) Файлы куки третьих лиц, которые устанавливаются третьими лицами с разрешения Пользователя и предназначены для проведения статистических исследований, касающихся поведения Пользователя в сети Интернет и/или направления персонализиированных рекламных или маркетинговых материалов Пользователю и/или предоставления товаров или услуг.
    Пользователь имеет право в любой момент отключить Файлы куки путем изменения определенных настроек в своем браузере. Такое отключение не влечет за собой ограничение или изменение доступа Пользователя к функциональным возможностям Сайта и/или его контенту. Для отключения Файлов куки нужно выполнить следующие действия:
    ________


    4. ЦЕЛИ СБОРА И ОБРАБОТКИ ПЕРСОНАЛЬНЫХ ДАННЫХ
    Определение целей обработки
    Сбор и обработка Персональных данных осуществляется в следующих целях:
    (1) для анализа поведения Пользователя, а также выявления предпочтений Пользователя к определенному виду контента.
    (2) для оперативной и корректной работы Сайта, улучшения его функциональности и и контента.
    (3) для идентификации Пользователя.
    (4) для соблюдения требований Закона.
    (5) для технической поддержки Сайта, выявления проблем в его работе и их устранение.
    (6) для поддержания связи с Пользователем (коммуникация).
    (7) для выполнения иных обязательств Правообладателя, которые возникли перед Пользователем.
    (8) для проведения статистических исследований.
    (9) для любых других целей, при условии получения отдельного согласия от Пользователя.
    Обработка Персональных данных осуществляется на основе принципов: (1) законности целей и способов обработки; и (2) добросовестности; и (3) соответствия целей обработки Персональных данных целям, заранее определенным и заявленным при сборе таких Персональных данных; и (4) соответствия объема и характера обрабатываемых Персональных данных заявленным целям их обработки.
    Условия обработки персональных данных
    Обработка Персональных данных проводится в случаях: (1) получения согласия от Пользователя; или (2) достижения Правообладателем целей, предусмотренных международным договором или Законом; или (3) предоставления Пользователем своих Персональных данных неограниченному кругу лицу; или (4) выполнения иных обязательств Правообладателя перед Пользователем, включая, однако не ограничиваясь, предоставление определенного контента Пользователю; или (5) спасения жизни или здоровья Пользователя, когда согласие на обработку его Персональных данных не удается получить заблаговременно.
    В случае обезличивания Персональных данных, что не позволяет прямо или опосредованно определить Пользователя, последующее использование и раскрытие таких данных третьим лицам допускается и в отношении их более не применяются правила данной Политики.
    Правообладатель принимает все возможные меры для защиты конфиденциальности полученных Персональных данных, за исключением случаев, когда Пользователь сделал такие данные общедоступными.
    Обработка Персональных данных осуществляется с использованием средств автоматизации и без использования таких средств автоматизации.


    5. ДОСТУП ТРЕТЬИХ ЛИЦ К ПЕРСОНАЛЬНЫМ ДАННЫМ
    Использование аналитических платформ
    Правообладатель использует аналитическую платформу Google Analytics для (1) отслеживания частоты посещаемости сайта Пользователями; и (2) отслеживания способов использования Пользователем Сайта и/или его контента; и (3) выявления типа и вида контента, который является популярными среди Пользователей; и (4) определения места нахождения Пользователя. Пользователь также дает свое согласие Правообладателю на использование им информации, полученной о Пользователе от Google Analytics.
    Для указанных целей аналитическая платформа Google Analytics может собирать данные об IP адресе, геолокации, поведении Пользователя, а также его предпочтениях и интересе в отношении определенного контента.
    Аналитическая платформа Google Analytics получает доступ к Персональным данным с тем, чтоб предоставить Правообладателю понимание того насколько эффективно работает его Сайт, какой именно контент является популярным, насколько эффективно размещение в нем той или иной рекламы, а также для целей разработки и/или улучшения существующей маркетинговой стратегии Правообладателя.
    С момента использования Сайта Пользователь соглашается с политикой конфиденциальности (Privacy Policy) Google Analytics, а также с автоматической установкой на устройство Пользователя соответствующих Файлов куки.
    Раскрытие персональных данных третьим лицам
    Правообладатель имеет право раскрывать Персональные данные (1) своим аффилированным лицам, филиалам и представительствам, открытым как на территории Республика Казахстан, так и на территории других государств; (2) правопреемникам Правообладателя, которые возникли в результате его ликвидации, реорганизации или банкротства, и которые получили исключительные права владения Сайтом; (3) третьим лицам исключительно для целей оказания получения Пользователем определенного контента или доступа к нему; (4) третьим лицам, когда Пользователем было дано согласие на раскрытие, передачу или обработку своих Персональных данных, а также в иных случаях, прямо предусмотренных Законом или данной Политикой.
    Правообладатель раскрывает Персональные данные только в том случае, если (1) уверен, что третьи лица будут соблюдать условия данной Политики и предпринимать такие же меры по защите конфиденциальности Персональных данных, которые предпринимает сам Правообладатель, и (2) согласие на такое раскрытие было предварительно выражено Пользователем и/или допускается на основании Закона.


    6. РАЗМЕЩЕНИЕ РЕКЛАМЫ
    Реклама на Сайте
    Правообладатель не размещает рекламу на Сайте.


    7. НАПРАВЛЕНИЕ ЖАЛОБ И ЗАПРОСОВ ПРАВООБЛАДАТЕЛЮ
    Требование о прекращении обработки персональных данных
    Каждый Пользователь имеет право выразить свое возражение Правообладателю против обработки и/или хранения его Персональных данных. Такое возражение может быть выражено следующим образом:
    ________
    Запрос на получение информации о персональных данных
    Если у Пользователя возникают вопросы, связанные с порядком применения или использования настоящий Политики, порядком и/или способом обработки Персональных данных, Пользователь может задать такой вопрос следующим образом:
    ________
    Изменение (обновление, дополнение, корректировка) или удалении персональных данных
    Пользователь имеет право в любой момент самостоятельно изменить или удалить свои Персональные данные, за исключением случаев, когда такое изменение или удаление может привести (1) к нарушению правил настоящей Политики; или (2) к нарушению Закона; или (3) характер таких Персональных данных является доказательством в каком-либо судебном процессе, возникшем между Правообладателем и Пользователем.
    Пользователь имеет право изменить или удалить свои Персональные данные в следующий способ:
    ________


    8. СРОКИ И ПОРЯДОК ХРАНЕНИЯ ПЕРСОНАЛЬНЫХ ДАННЫХ
    Хранение осуществляется самостоятельно Правообладателем.
    Хранение осуществляется в течение следующего срока: 1 месяц от момента получения такой информации.
    После окончания срока хранения Персональных данных, такие данные подлежат немедленному их уничтожению или обезличиванию, если только иное не запрещено Законом или положениями данной Политики.


    9. ДОСТУП НЕСОВЕРШЕННОЛЕТНИХ К САЙТУ
    Сайт может быть использовано лицами в возрасте до 18 лет. Поскольку Сайт не собирает личные данные о Пользователях, согласие на обработку Личных данных несовершеннолетних Пользователей не требуется.
    Если несовершеннолетний Пользователь не может предоставить согласие на обработку его Персональных данных от законного представителя (опекуна), в таком случае такой Пользователь обязан немедленно прекратить использование Сайта.


    10. ПОРЯДОК ЗАЩИТЫ ПЕРСОНАЛЬНЫХ ДАННЫХ
    Защита конфиденциальности Персональных данных является первостепенной и важной задачей для Правообладателя. Правообладатель придерживается всех требуемых международных стандартов, правил и рекомендаций по защите Персональных данных.
    Правообладатель внедрил ряд технических и организационных методов, направленных на защиту Персональных данных от разглашения или несанкционированного доступа к ним третьих лиц. Для обеспечения сохранности и конфиденциальности получаемых Персональных данных Правообладатель использует следующие средства защиты:
    ________


    11. ЗАКЛЮЧИТЕЛЬНЫЕ ПОЛОЖЕНИЯ
    Доступность текста политики для ознакомления
    Пользователи могут ознакомиться с условиями данной Политики по следующей ссылке: https://www.remont-shymkent.kz/policy.
    Данная редакция Политики действует от 1 апреля 2023 годa.
    Изменение и дополнение политики
    Настоящая Политика может быть изменена время от времени. Правообладатель не несет какой-либо ответственности перед Пользователем за изменение условий данной Политики без разрешения и/или согласия Пользователя.
    Пользователь сам обязуется на регулярной основе проверять положения данной Политики на предмет ее возможного изменения или дополнения.
    Применимое законодательство
    Настоящая Политика разработана в соответствие с действующим законодательством о защите персональных данных Республика Казахстан, в частности, с нормами Закон Республики Казахстан от 21 мая 2013 года № 94-V «О природной среде и их защите» (с изменениями и дополнениями по состоянию на 01.05.2023 г.).О внесении изменений в отдельные законодательные акты Республика Казахстан в части уточнения порядка обработки персональных данных в информационно-телекоммуникационных сетях" (со всеми дополнениями и изменениями).
    Риск разглашения
    Вне зависимости от предпринимаемых Правообладателем мер защиты конфиденциальности получаемых персональных данных, Пользователь настоящим считается должным образом ознакомлен с тем, что любая передача Персональных данных в сети Интернет не может быть гарантировано безопасной, а потому Пользователь осуществляет такую передачу на свой собственный риск.
</div>
        </div>
    );
};

export default MyComponent;
